snlkuharlocal/src/InformationRegisters/РеквизитыСправочников/РеквизитыСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыСправочников</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Справочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостояниеЗаказаПоставщику/СостояниеЗаказаПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеЗаказаПоставщику</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПредварительныйЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденныйЗаказ</name>
  </enumValues>
  <enumValues>
    <name>Ликвидирован</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Таможня</name>
    <comment>Растамаживается</comment>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>ВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>Произведен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ВПутиВРФ</name>
  </enumValues>
  <enumValues>
    <name>ГотовоКОтгрузке</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыПодразделений/ВидыПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПодразделений</name>
  <enumValues>
    <name>Торговое</name>
  </enumValues>
  <enumValues>
    <name>Управляющее</name>
  </enumValues>
  <enumValues>
    <name>Сервисное</name>
  </enumValues>
  <enumValues>
    <name>Франчайзинг</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыРекламаций/ВидыРекламаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРекламаций</name>
  <enumValues>
    <name>Рекламация</name>
  </enumValues>
  <enumValues>
    <name>Вычерк</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СпособыУчетаРасходовКомиссионера/СпособыУчетаРасходовКомиссионера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыУчетаРасходовКомиссионера</name>
  <enumValues>
    <name>УПДкОтчетуКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>УПДкУСО</name>
  </enumValues>
  <enumValues>
    <name>УПДотсутствует</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/CommonModules/УчетВзаиморасчетов/Module.bsl
Функция СоздатьТаблицуДвижений(ИмяРегистра)
	Набор=РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
	
	Возврат Набор.Выгрузить();	
КонецФункции // СоздатьТаблицуДвижений(ИмяРегистра) 

// +++ 2011-11-21 сезонные бонусы
Функция ПровестиПоВзаиморасчетамСезонныеБонусы(Документ, Движения) Экспорт 
	
	Если ПараметрыСеанса.Отладка Тогда
		Сообщить("Проведение: "+Документ);
	КонецЕсли;
	
	Доллары=Справочники.Валюты.НайтиПоКоду("840");
	Рубли=Справочники.Валюты.НайтиПоКоду("810");
	
	Результат	=1;
	ТОшибок		=Неопределено;	
	
	ВалютаУпр	= ПараметрыСеанса.ВалютаУпр_2009;
	КурсУпр		= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Документ.Дата);
	
	ТДВ = СоздатьТаблицуДвижений("Взаиморасчеты");	
	
	ТекВид=Документ.Метаданные().Имя;	
	ТекДок=Документ;
	
	ДатаДокумента=ТекДок.Дата;
	
	#Если Клиент Тогда
		Состояние(""+ТекВид+" "+ТекДок.Номер+" "+ТекДок.Дата);
	#КонецЕсли
	
	СуммаБонуса = Документ.Товары.Итог("ВсегоБезБонуса") - Документ.СуммаДокумента;
	
	Если СуммаБонуса <> 0 Тогда
		
		ТекКонтрагент			=?(Документ.Контрагент.Ведущий.Пустая(),Документ.Контрагент,Документ.Контрагент.Ведущий);	
		ДоговорСезонногоБонуса	= ПолучитьДоговорСезонногоБонуса(Документ.Контрагент);		
		ВалютаДокумента			= Документ.Валюта; // валюта бонуса = валюта документа
		КурсДокумента			= Документ.Курс;
		СуммаДокумента			= СуммаБонуса;
		
		// Выполняем 1 или 2 движения (в зависимости о признака отгрузки):
		//	1-ое движение: по договору сезонного бонуса
		//	2-ое движение: по основному договору 	
		КолвоДвижений = ?(Документ.Отгружен = Перечисления.Отгружен.Отгружен, 2, 1);
		
		Для Сч = 1 По КолвоДвижений Цикл
			
			ТекДоговор		= ?(Сч = 1, ДоговорСезонногоБонуса, Документ.Договор);		
			ВалютаРасчетов	= ПолучитьВалютуРасчетов(ТекДоговор);
			
			Запись = ТДВ.Добавить();
			Запись.Период			= Документ.Дата;
			Запись.Активность		= Истина;		
			Запись.Контрагент		= ТекКонтрагент;		
			Запись.Договор			= ТекДоговор;
			Запись.СуммаДокумента	= СуммаДокумента;			
			Запись.ВалютаДокумента	= ВалютаДокумента;				
			Запись.ВидДвижения		= ?(Сч = 1, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
			Запись.СуммаВал			= глПересчет(СуммаДокумента, ВалютаДокумента, КурсДокумента, ВалютаРасчетов, ДатаДокумента);
			Запись.СуммаУпр			= глПересчет(СуммаДокумента, ВалютаДокумента, ДатаДокумента, ВалютаУпр, КурсУпр);		
			Запись.КодОперации		= Перечисления.КодыОперацийОстатки.Бонус; // ?(Сч = 1, Перечисления.КодыОперацийОстатки.Бонус, Перечисления.КодыОперацийОстатки.Реализация);
			
			Если Запись.СуммаВал=0 И Запись.СуммаУпр=0 Тогда
				ТДВ.Удалить(Запись);		
			КонецЕсли; 
			
		КонецЦикла; // Для Сч = 1 По КолвоДвижений Цикл
		
	КонецЕсли; // Если СуммаБонуса <> 0 Тогда
	
	Движения=Новый Структура("Взаиморасчеты",ТДВ);		
	
	Возврат Новый Структура("Результат,ТОшибок",Результат,ТОшибок);
КонецФункции
// 2011-11-21 сезонные бонусы +++


Функция СуммаПСвРНК(ДокСсылка)
	//крохин начало 31.05.2019
	//может быть не только РНК
	МетаДок				= ДокСсылка.Метаданные();
	Если НЕ ЕстьТабЧастьДокумента("Товары",МетаДок) Тогда	
		Возврат 0;		
	КонецЕсли;
	ВидНакладной = МетаДок.Имя;
	//крохин конец 31.05.2019
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	СУММА(Всего) КАК СуммаПроданныхСертификатов
	|ИЗ
	//крохин начало 31.05.2019
	////может быть не только РНК
	//|	Документ.РасходнаяНакладная.Товары
	|	Документ."+ВидНакладной+".Товары
	//крохин конец 20.05.2019
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.ПодарочныйСертификат)
	|";
	
	Запрос.УстановитьПараметр("Ссылка",ДокСсылка);
	
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.СуммаПроданныхСертификатов) Тогда
		Возврат Выборка.СуммаПроданныхСертификатов;
	Иначе
		Возврат 0;
	КонецЕсли; 
КонецФункции //СуммаПСвРНК(ДокСсылка)


Функция ПровестиПоВзаиморасчетам(Документ,Движения)
	Если ПараметрыСеанса.Отладка Тогда
		Сообщить("Проведение: "+Документ);
	КонецЕсли;
	
	
	Доллары=Справочники.Валюты.НайтиПоКоду("840");
	Рубли=Справочники.Валюты.НайтиПоКоду("810");
	
	Результат	=1;
	ТОшибок		=Неопределено;	
	
	ВалютаУпр	= ПараметрыСеанса.ВалютаУпр_2009;
	КурсУпр		= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Документ.Дата);
	
	ТДВ=СоздатьТаблицуДвижений("Взаиморасчеты");	
	
	ТекВид=Документ.Метаданные().Имя;	
	ТекДок=Документ;
	
	ДатаДокумента=ТекДок.Дата;
	
	#Если Клиент Тогда
		Состояние(""+ТекВид+" "+ТекДок.Номер+" "+ТекДок.Дата);
	#КонецЕсли
	
	//крохин начало 05.05.2020
	//комиссионная торговля
	//проводки по взаиморасчетам формирует только отчёт комиссионера
	Если ТекВид="РасходнаяНакладная" И ТекДок.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
		Движения=Новый Структура("Взаиморасчеты",ТДВ);		
		
		Возврат Новый Структура("Результат,ТОшибок",Результат,ТОшибок);
	КонецЕсли;
	
	Если ТекВид = "РекламационнаяНакладная" И  ТекДок.ДокОснование.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
		Движения=Новый Структура("Взаиморасчеты",ТДВ);		
		
		Возврат Новый Структура("Результат,ТОшибок",Результат,ТОшибок);
		
	КонецЕсли;
	Если ТекВид = "КорректировкаЦенВНакладной" И  ТекДок.ДокОснование.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
		Движения=Новый Структура("Взаиморасчеты",ТДВ);		
		
		Возврат Новый Структура("Результат,ТОшибок",Результат,ТОшибок);
		
	КонецЕсли;
	
	Если Теквид = "ОтчетКомиссионера" Тогда
		
		ТекКонтрагент			=?(Документ.Контрагент.Ведущий.Пустая(),Документ.Контрагент,Документ.Контрагент.Ведущий);
		ВалютаРасчетов			=ПолучитьВалютуРасчетов(Документ.Договор);			
		ВалютаДокумента			=ПолучитьВалютуРасчетов(Документ.Договор);
		КурсДокумента			=1;
		// Кухарь А.Ю. 18.06.2020 начало
		// Аня попросила вместо 1й суммирующей проводки писать все + и все - проводки
		// Это проводка +
		//СуммаДокумента =  Документ.СуммаОплата;
		СуммаДокумента = Документ.СуммаДокумента;
		// Кухарь А.Ю. 18.06.2020 конец		
		
								//крохин начало 26.11.2021
		//оплата бонусами по отдельному договору
		СуммаОплатыБонусами = Документ.СуммаОплатыБонусами;
		Если СуммаОплатыБонусами <> 0 Тогда
			СуммаДокумента = СуммаДокумента - СуммаОплатыБонусами;
			Запись=ТДВ.Добавить();
			Запись.Период			=Документ.Дата;
			Запись.Активность		=Истина;
			
			Запись.Контрагент		=ТекКонтрагент;		
			Запись.Договор			=Документ.ДоговорОплатыБонусами;
			Запись.Дата_НачалаЗадолженности = Документ.Дата;
			Если СуммаОплатыБонусами > 0 Тогда
				Запись.СуммаДокумента	=СуммаОплатыБонусами;
				Запись.ВалютаДокумента	=ВалютаДокумента;	
				Запись.ВидДвижения	=ВидДвиженияНакопления.Приход;
				Запись.СуммаВал			=глПересчет(СуммаОплатыБонусами,ВалютаДокумента,КурсДокумента,ВалютаРасчетов,ДатаДокумента);
				Запись.СуммаУпр			=глПересчет(СуммаОплатыБонусами,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсУпр);
				Запись.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
			Иначе
				Запись.СуммаДокумента	=-СуммаОплатыБонусами;
				Запись.ВалютаДокумента	=ВалютаДокумента;	
				Запись.ВидДвижения	=ВидДвиженияНакопления.Расход;
				Запись.СуммаВал			=-глПересчет(СуммаОплатыБонусами,ВалютаДокумента,КурсДокумента,ВалютаРасчетов,ДатаДокумента);
				Запись.СуммаУпр			=-глПересчет(СуммаОплатыБонусами,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсУпр);
				Запись.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
			КонецЕсли;
		КонецЕсли;
		//крохин конец 26.11.2021

		
		
		Запись=ТДВ.Добавить();
		Запись.Период			=Документ.Дата;
		Запись.Активность		=Истина;
		
		Запись.Контрагент		=ТекКонтрагент;		
		Запись.Договор			=Документ.Договор;
		Запись.Дата_НачалаЗадолженности = Документ.Дата;
		

				
		//крохин начало 07.12.2020
		//Запись.СуммаДокумента	=СуммаДокумента;
		//
		//Запись.ВалютаДокумента	=ВалютаДокумента;	
		//Запись.ВидДвижения	=ВидДвиженияНакопления.Приход;
		//Запись.СуммаВал			=глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаРасчетов,ДатаДокумента);
		//Запись.СуммаУпр			=глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсУпр);
		//Запись.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
        Если  СуммаДокумента >=0 Тогда
		Запись.СуммаДокумента	=СуммаДокумента;
		Запись.ВалютаДокумента	=ВалютаДокумента;	
		Запись.ВидДвижения	=ВидДвиженияНакопления.Приход;
		Запись.СуммаВал			=глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаРасчетов,ДатаДокумента);
		Запись.СуммаУпр			=глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсУпр);
		Запись.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
	Иначе
		Запись.СуммаДокумента	=-СуммаДокумента;
		
		Запись.ВалютаДокумента	=ВалютаДокумента;	
		Запись.ВидДвижения	=ВидДвиженияНакопления.Расход;
		Запись.СуммаВал			=-глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаРасчетов,ДатаДокумента);
		Запись.СуммаУпр			=-глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсУпр);
		Запись.КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
		КонецЕсли;
		//крохин конец 07.12.2020
				
		// Кухарь А.Ю. 18.06.2020 начало
		// Аня попросила вместо 1й суммирующей проводки писать все + и все - проводки
		// Это проводки -
		ТЗРасходов=ИнициализироватьТаблицуРасходов(Документ,ТекКонтрагент,Документ.договор,Документ.ОтдельныеДоговораРасходов);	
		для каждого СтрТЗРасходов из ТЗРасходов цикл
			Расходы=документ[СтрТЗРасходов.ВидРасходов];
			//крохин начало 07.12.2020
			//если Расходы>0 тогда
			если Расходы<>0 тогда
			//крохин конец 07.12.2020	
				ТекКонтрагент			=?(Документ.Контрагент.Ведущий.Пустая(),Документ.Контрагент,Документ.Контрагент.Ведущий);
				ВалютаРасчетов			=ПолучитьВалютуРасчетов(Документ.Договор);			
				ВалютаДокумента			=ПолучитьВалютуРасчетов(Документ.Договор);
				КурсДокумента			=1;
				СуммаДокумента = Расходы;	
				Запись=ТДВ.Добавить();
				Запись.Период			=Документ.Дата;
				Запись.Активность		=Истина;			
				Запись.Контрагент		=ТекКонтрагент;		
				Запись.Договор			=СтрТЗРасходов.Договор;
				Запись.Дата_НачалаЗадолженности = Документ.Дата;

				//крохин начало 07.12.2020
				//Запись.СуммаДокумента	=СуммаДокумента;
				//
				//Запись.ВалютаДокумента	=ВалютаДокумента;	
				//Запись.ВидДвижения	=ВидДвиженияНакопления.расход;
				//Запись.СуммаВал			=глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаРасчетов,ДатаДокумента);
				//Запись.СуммаУпр			=глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсУпр);

				Если  СуммаДокумента >=0 Тогда
					Запись.СуммаДокумента	=СуммаДокумента;
					Запись.ВалютаДокумента	=ВалютаДокумента;	
					Запись.ВидДвижения	=ВидДвиженияНакопления.расход;
					Запись.СуммаВал			=глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаРасчетов,ДатаДокумента);
				Запись.СуммаУпр			=глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсУпр);
				Иначе
					Запись.СуммаДокумента	=-СуммаДокумента;
					
					Запись.ВалютаДокумента	=ВалютаДокумента;	
					Запись.ВидДвижения	=ВидДвиженияНакопления.приход;
					Запись.СуммаВал			=-глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаРасчетов,ДатаДокумента);
				    Запись.СуммаУпр			=-глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсУпр);

				КонецЕсли;
				//крохин конец 07.12.2020
				

			//крохин начало 15.08.2020
			//код операции пустой, это затраты
				//Запись.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;		
			//крохин конец 15.08.2020	
			КонецЕсли;
		КонецЦикла;		
		// Кухарь А.Ю. 18.06.2020 конец		
		
	КонецЕсли;
	
	//крохин начало 10.12.2020
	Если ТекВид="ПриходнаяНакладная" И ТекДок.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
		Движения=Новый Структура("Взаиморасчеты",ТДВ);		
		
		Возврат Новый Структура("Результат,ТОшибок",Результат,ТОшибок);
	КонецЕсли;
	Если ТекВид="Претензия" И ТекДок.ДокОснование.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия Тогда
		Движения=Новый Структура("Взаиморасчеты",ТДВ);		
		
		Возврат Новый Структура("Результат,ТОшибок",Результат,ТОшибок);
	КонецЕсли;
    //крохин конец 10.12.2020
	
	//крохин конец 05.05.2020
	
	
	//крохин начало 08.12.2011
	//+вычерк
	//Если ТекВид="РасходнаяНакладная" ИЛИ ТекВид="ПриходнаяНакладная" ИЛИ ТекВид="ЗаказПоставщику" или ТекВид="ПродажаИМ" Тогда
	Если ТекВид="РасходнаяНакладная" ИЛИ ТекВид="ПриходнаяНакладная" ИЛИ ТекВид="ЗаказПоставщику" или ТекВид="ПродажаИМ" ИЛИ ТекВид = "РекламационнаяНакладная" ИЛИ ТекВид = "Претензия" Тогда
		//крохин конец 08.12.2011
		//крохин начало 08.12.2011
		//ТекКонтрагент			=?(Документ.Контрагент.Ведущий.Пустая(),Документ.Контрагент,Документ.Контрагент.Ведущий);
		Если ТекВид = "РекламационнаяНакладная" Тогда
			Если документ.Корреспондент.Метаданные().Имя = "Контрагенты" Тогда
				ТекКонтрагент			=?(Документ.Корреспондент.Ведущий.Пустая(),Документ.Корреспондент,Документ.Корреспондент.Ведущий);
			Иначе
				ТекКонтрагент = Документ.Корреспондент;
			КонецЕсли;
		Иначе
			ТекКонтрагент			=?(Документ.Контрагент.Ведущий.Пустая(),Документ.Контрагент,Документ.Контрагент.Ведущий);
		КонецЕсли;
		//крохин конец 08.12.2011
		
		Если ТекВид="ЗаказПоставщику" Тогда
			
			//Михайловский 20230322 компенс +++
			//вместо 20230503 -все обратно!!
			СуммаДокумента			=Документ.Товары.Итог("Всего");
			Если Документ.Товары.Итог("Компенсация") Тогда
				СуммаДокументаО		= Документ.Товары.Итог("ВсегоСКомпенсацией");
			Иначе	
				СуммаДокументаО		= Документ.Товары.Итог("Всего");
			КонецЕсли;
			//Михайловский 20230322 компенс ---
			
			// +++ 2011-11-21 сезонные бонусы
		ИначеЕсли ТекВид="РасходнаяНакладная" Тогда
			СуммаДокумента			=?(Документ.СезонныйБонус, Документ.Товары.Итог("ВсегоБезБонуса"), Документ.СуммаДокумента);
			// 2011-11-21 сезонные бонусы +++
		Иначе
			СуммаДокумента			=Документ.СуммаДокумента;			
		КонецЕсли; 		
		
		ВалютаРасчетов			=ПолучитьВалютуРасчетов(Документ.Договор);		
		
		ВалютаДокумента			=Документ.Валюта;
		КурсДокумента			=Документ.Курс;
		
		Запись=ТДВ.Добавить();
		Запись.Период			=Документ.Дата;
		Запись.Активность		=Истина;
		
		Запись.Контрагент		=ТекКонтрагент;		
		Запись.Договор			=Документ.Договор;
		
		//Катаев+ 19/08/14 По умолчанию дата возникновения задолжености берется из реквизита "Дата оплаты". Если его нет или он пустой, то берем дату документа
		Если ЕстьРеквизитДокумента("ДатаОплаты", Документ.Метаданные()) Тогда
			Если Документ.ДатаОплаты = Дата(1,1,1) Тогда
				//крохин начало 10.07.2016
				//информация перенесена из измерения в реквизит
				//		Запись.ДатаНачалаЗадолженности = Документ.Дата;
				//	Иначе
				//		Запись.ДатаНачалаЗадолженности = Документ.ДатаОплаты;
				//	КонецЕсли;
				//Иначе
				//	Запись.ДатаНачалаЗадолженности = Документ.Дата;
				Запись.Дата_НачалаЗадолженности = Документ.Дата;
			Иначе
				Запись.Дата_НачалаЗадолженности = Документ.ДатаОплаты;
			КонецЕсли;
		Иначе
			Запись.Дата_НачалаЗадолженности = Документ.Дата;
			//крохин конец 10.07.2016
		КонецЕсли;
		//Катаев- 18/08/14
		//крохин начало 08.12.2011
		//+вычерк
		Если ТекВид = "РекламационнаяНакладная" Тогда
			
			//Нечаева 02,07,14 +++ заполнение договора  из самого документа
			попытка
				//Катаев+ 23/09/14 Если документа основания нет в базе то берем договор из документа
				//Если Документ.Дата>Дата(2014,6,1) Тогда
				Если Документ.Дата>Дата(2014,6,1) или Лев(Документ.ДокОснование.Ссылка,18) = "<Объект не найден>" Тогда
					//Катаев- 23/09/14
					Запись.Договор = Документ.Договор;
				Иначе
					Запись.Договор = Документ.ДокОснование.Договор;
				Конецесли;	
			исключение
			конецпопытки;
			//Нечаева 02,07,14 ---
			//Катаев+ 19/08/14 Дату возникновения задолженности берем из документа основания
			//крохин начало 10.07.2016
			//информация перенесена из измерения в реквизит
			//Запись.ДатаНачалаЗадолженности = Документ.ДокОснование.ДатаОплаты;
			Запись.Дата_НачалаЗадолженности = Документ.ДокОснование.ДатаОплаты;
			//крохин конец 10.07.2016
			//Катаев- 18/08/14
			
		КонецЕсли;
		//крохин конец 08.12.2011
		Если ТекВид="ЗаказПоставщику" Тогда
			Запись.СуммаДокумента	=СуммаДокументаО;
		Иначе
			Запись.СуммаДокумента	=СуммаДокумента;
		КонецЕсли;	
		
		Запись.ВалютаДокумента	=ВалютаДокумента;		
		
		Если ТекВид="РасходнаяНакладная" или ТекВид="ПродажаИМ" Тогда
			Запись.ВидДвижения	=ВидДвиженияНакопления.Приход;
			//крохин начало 19.12.2011
			//претензия 
		ИначеЕсли ТекВид="Претензия" Тогда
			Запись.ВидДвижения	=ВидДвиженияНакопления.Приход;
			//крохин конец 19.12.2011
		//+HELP-7109 20251112 Михайловский	
		ИначеЕсли ТекВид="РекламационнаяНакладная" Тогда
			Если ТипЗнч(ТекДок.ДокОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
				Запись.ВидДвижения	=ВидДвиженияНакопления.Приход;
			Иначе
				Запись.ВидДвижения	=ВидДвиженияНакопления.Расход;
			КонецЕсли;
		//-HELP-7109 20251112 Михайловский	
		Иначе		
			Запись.ВидДвижения	=ВидДвиженияНакопления.Расход;	
		КонецЕсли;		
		
		Запись.СуммаВал			=глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаРасчетов,ДатаДокумента);
		Если ТекВид="ЗаказПоставщику" Тогда
			Запись.СуммаУпр			=глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсУпр);			
		Иначе
			//крохин начало 12.03.2019
			//для валютных РНК курс во взаиморасчетах используется из документа, а не на дату
			//Запись.СуммаУпр			=глПересчет(СуммаДокумента,ВалютаДокумента,ДатаДокумента,ВалютаУпр,КурсУпр);
			Если ТекВид="РасходнаяНакладная" И ДатаДокумента >= '20190101' И ВалютаДокумента <> ВалютаУпр Тогда
				Запись.СуммаУпр			=глПересчет(СуммаДокумента,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсУпр);
			Иначе
				Запись.СуммаУпр			=глПересчет(СуммаДокумента,ВалютаДокумента,ДатаДокумента,ВалютаУпр,КурсУпр);
			КонецЕсли;
			
			//крохин конец 12.03.2019
			
		КонецЕсли;		
		
		Если ТекВид="РасходнаяНакладная" или ТекВид="ПродажаИМ" Тогда
			Если ЗначениеЗаполнено(Документ.Договор) И Документ.Договор.ВидДоговора_Новый=Справочники.ВидыДоговоров.Бонус Тогда
				Запись.КодОперации=Перечисления.КодыОперацийОстатки.Бонус;
			Иначе
				Запись.КодОперации=Перечисления.КодыОперацийОстатки.Реализация;
			КонецЕсли;
		ИначеЕсли ТекВид="ПриходнаяНакладная" Тогда
			Запись.КодОперации=Документ.КодОперации;  
			//+++Чирков 29.04.2026 - перенос расчетов на возвратные догора по рекламациям
			Если Запись.КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя 
				И ИспользоватьВспомогательныеДоговораПриВозвратах(Документ.Дата) 
				И ЕстьСтрокиРекламацийвПНК(Документ.Ссылка) Тогда
				Запись.Договор = Справочники.Договоры.НайтиСоздатьДоговорВозврата(Запись.Договор);			
			КонецЕсли;
			//---Чирков 29.04.2026
		КонецЕсли;		
		
		//крохин начало 08.12.2011
		Если ТекВид = "РекламационнаяНакладная" Тогда
			//+HELP-7109 20251112 Михайловский
			//Запись.КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя; 
			Если ТипЗнч(ТекДок.ДокОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
				Запись.КодОперации=Перечисления.КодыОперацийОстатки.ВозвратПоставщику;
			Иначе
				Запись.КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
			КонецЕсли;
			//-HELP-7109 20251112 Михайловский
		КонецЕсли;
		//крохин конец 08.12.2011
		
		//крохин начало 05.05.2020
		//комиссионная торговля
		Если (ТекВид="РасходнаяНакладная" И ТекДок.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия)
			ИЛИ (ТекВид = "РекламационнаяНакладная" И ТекДок.ДокОснование.Метаданные().Имя = "РасходнаяНакладная" И ТекДок.ДокОснование.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия) Тогда
			Запись.КодОперации = Перечисления.КодыОперацийОстатки.Комиссия;
			//Запись.Договор = Документ.ДоговорКомиссия;
		КонецЕсли;
		
		//крохин конец 05.05.2020
		
		
		Если Запись.СуммаВал=0 И Запись.СуммаУпр=0 Тогда
			ТДВ.Удалить(Запись);		
		КонецЕсли; 
		
		//крохин начало 22.01.2020
		//при заполнении "суммы скидки" формируются доп. проводки
		Если ТекВид = "РасходнаяНакладная" И Документ.СуммаСкидкиДС <> 0 Тогда
			СуммаСкидкиДС = Документ.СуммаСкидкиДС;
			Запись=ТДВ.Добавить();                                           
			Запись.Период			=Документ.Дата;
			Запись.Активность		=Истина;
			Запись.ВидДвижения		=ВидДвиженияНакопления.Приход;
			
			Запись.СуммаУпр			=глПересчет(СуммаСкидкиДС,ВалютаДокумента,КурсДокумента,ВалютаУпр,Документ.Дата);
			Запись.СуммаВал			=глПересчет(СуммаСкидкиДС,ВалютаДокумента,КурсДокумента,ВалютаРасчетов,КурсДокумента);
			
			Запись.Контрагент		=ТекКонтрагент;		
			Запись.Договор			=Документ.ДоговорСкидкиДС;
			
			Запись.СуммаДокумента	=СуммаДокумента;
			Запись.ВалютаДокумента	=ВалютаДокумента;
			
		КонецЕсли;	
		Если (ТекВид = "РекламационнаяНакладная") И Документ.СуммаСкидкиДС <> 0 Тогда
			СуммаСкидкиДС = Документ.СуммаСкидкиДС;
			Запись=ТДВ.Добавить();                                           
			Запись.Период			=Документ.Дата;
			Запись.Активность		=Истина;
			Запись.ВидДвижения		=ВидДвиженияНакопления.Расход;
			
			Запись.СуммаУпр			=глПересчет(СуммаСкидкиДС,ВалютаДокумента,КурсДокумента,ВалютаУпр,Документ.Дата);
			Запись.СуммаВал			=глПересчет(СуммаСкидкиДС,ВалютаДокумента,КурсДокумента,ВалютаРасчетов,КурсДокумента);
			
			Запись.Контрагент		=ТекКонтрагент;		
			Запись.Договор			=Документ.ДоговорСкидкиДС;
			
			Запись.СуммаДокумента	=СуммаДокумента;
			Запись.ВалютаДокумента	=ВалютаДокумента;
			
		КонецЕсли;	 				
		//крохин конец 22.01.2020
		
		Если ТекВид="ЗаказПоставщику" Тогда		
			Если Документ.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ВРаботе ИЛИ Документ.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ПредварительныйЗаказ ИЛИ Документ.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ПодтвержденныйЗаказ Тогда
				ТДВ.Очистить();
			Иначе
				Если Документ.Расходы.Количество()>0 Тогда
					Для Каждого СтрокаТЧ Из Документ.Расходы Цикл
						Если СтрокаТЧ.СтатьяЗатрат.Пустая() Тогда
							ВалютаРасчетов=ПолучитьВалютуРасчетов(СтрокаТЧ.Договор);
							
							ТекКонтрагент=?(СтрокаТЧ.Контрагент.Ведущий.Пустая(),СтрокаТЧ.Контрагент,СтрокаТЧ.Контрагент.Ведущий);
							
							Запись=ТДВ.Добавить();
							Запись.Период			=Документ.Дата;
							Запись.Активность		=Истина;
							Запись.ВидДвижения		=ВидДвиженияНакопления.Расход;
							
							Запись.СуммаУпр			=глПересчет(СтрокаТЧ.Всего,СтрокаТЧ.Валюта,СтрокаТЧ.Курс,ВалютаУпр,Документ.Дата);
							Запись.СуммаВал			=глПересчет(СтрокаТЧ.Всего,СтрокаТЧ.Валюта,СтрокаТЧ.Курс,ВалютаРасчетов,СтрокаТЧ.Курс);
							
							Запись.Контрагент		=ТекКонтрагент;		
							Запись.Договор			=СтрокаТЧ.Договор;
							
							Запись.СуммаДокумента	=СтрокаТЧ.Всего;
							Запись.ВалютаДокумента	=СтрокаТЧ.Валюта;
						КонецЕсли;				
					КонецЦикла;  							
				КонецЕсли;				
			КонецЕсли; 
		ИначеЕсли ТекВид="ПриходнаяНакладная" Тогда
			Если ТипЗнч(Документ.ДокОснование)=Тип("ДокументСсылка.ЗаказПоставщику") И Документ.ДокОснование.Проведен Тогда
				ТДВ.Очистить();
			КонецЕсли;			
		КонецЕсли;
		//крохин начало 05.05.2011
		//с 1 апреля 2011 г.  продажа сертификатов формирует дебиторскую задолженность перед контрагентом "оплата сертификатом"
		Если ТекДок.Дата >= '20110401'  Тогда
			СуммаПроданныхСертификатов = СуммаПСвРНК(ТекДок);
			
			Если СуммаПроданныхСертификатов > 0 Тогда
				ТекКонтрагент = Справочники.Контрагенты.НайтиПоКоду("SMN-7258");
				
				Запись=ТДВ.Добавить();
				
				Запись.Период			=Документ.Дата;
				Запись.Активность		=Истина;
				//крохин начало 09.06.2013
				//появились ПНК-возвраты подарочных сертификатов, от юр.лиц		
				//		Запись.ВидДвижения		=ВидДвиженияНакопления.Расход;
				//крохин начало 30.09.2018
				//здесь должно быть указание на вид документа, а не код операции - "плюс" всегда в ПНК, минус - в РНК. Но пока и так работает, так как приход от поставщика без цен и проводки нет совсем
				//возвраты от франчайзи должны быть обязательно с кодом операции "возврат от покупателя".
				//крохин конец 30.09.2018
				Если Документ.КодОперации = Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя Тогда
					Запись.ВидДвижения		=ВидДвиженияНакопления.Приход;	
				Иначе
					Запись.ВидДвижения		=ВидДвиженияНакопления.Расход;	
				КонецЕсли;
				//крохин конец 09.06.2013		
				Запись.КодОперации		=Документ.КодОперации;						
				Запись.Контрагент		=ТекКонтрагент;
				//крохин начало 16.01.2021
				//Запись.Договор = ТекКонтрагент.ОсновнойДоговор;
				Если Документ.Дата >= '20201216' Тогда				
				ДоговорСертификаты = ПолучитьДоговорСертификатыФранчайзи(Документ.Контрагент.Ведущий);
				Запись.Договор = ДоговорСертификаты;
			Иначе
				Запись.Договор = ТекКонтрагент.ОсновнойДоговор;
				КонецЕсли;
				//крохин конец 16.01.2021
				
				Запись.СуммаВал			=СуммаПроданныхСертификатов;
				Запись.СуммаУпр			=СуммаПроданныхСертификатов;
				Запись.ВалютаДокумента	=Документ.Валюта;
				Запись.СуммаДокумента	=СуммаПроданныхСертификатов;
			КонецЕсли;
		КонецЕсли;
		//крохин конец 05.05.2011
		
		
		
	ИначеЕсли ТекВид="ОтчетКассовойСмены" Тогда
		//ОКС
		ВидДвижения			=?(Документ.КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
		ВидДвиженияОплаты	=?(Документ.КодОперации=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
		
		ТВ=Документ.Товары.Выгрузить();
		ТВ.Свернуть("Контрагент,СДокументами","Всего");
		Для Каждого СтрокаТВ Из ТВ Цикл
			//крохин начало
			Если СтрокаТВ.Всего = 0 Тогда Продолжить Конецесли;
			//крохин конец
			Запись=ТДВ.Добавить();
			
			Запись.Период			=Документ.Дата;
			Запись.Активность		=Истина;
			
			Запись.ВидДвижения		=ВидДвижения;
			Запись.КодОперации		=Документ.КодОперации;
			
			ТекКонтрагент			=СтрокаТВ.Контрагент;
			Если ТекКонтрагент<>Неопределено И НЕ ТекКонтрагент.Пустая() И НЕ ТекКонтрагент.Ведущий.Пустая() Тогда
				ТекКонтрагент		=ТекКонтрагент.Ведущий;		
			КонецЕсли;
			
			Запись.Контрагент		=ТекКонтрагент;
			Если СтрокаТВ.СДокументами Тогда
				Запись.Договор			=ТекКонтрагент.ОсновнойДоговор;			
			Иначе
				Запись.Договор			=ТекКонтрагент.ОсновнойДоговорКасса;
			КонецЕсли;
			//крохин начало
			//если договор касса не определился, ставим основной из контрагента SSP
			Если Документ.Дата >= '20101001' Тогда
				Если СтрокаТВ.Контрагент<>Неопределено И Запись.Договор = Справочники.Договоры.ПустаяСсылка() Тогда
					Запись.Договор = СтрокаТВ.Контрагент.ОсновнойДоговорКасса;
					Если Запись.Договор = Справочники.Договоры.ПустаяСсылка() Тогда
						Запись.Договор = СтрокаТВ.Контрагент.ОсновнойДоговор;	
					КонецЕсли;
					Если Запись.Договор = Справочники.Договоры.ПустаяСсылка() Тогда
						Запись.Договор = СтрокаТВ.Контрагент.Ведущий.ОсновнойДоговорКасса;	
					КонецЕсли;
					Если Запись.Договор = Справочники.Договоры.ПустаяСсылка() Тогда
						Запись.Договор = СтрокаТВ.Контрагент.Ведущий.ОсновнойДоговор;	
					КонецЕсли;
				КонецЕсли;
			Конецесли;
			//крохин конец
			
			Запись.СуммаВал			=СтрокаТВ.Всего;
			Запись.СуммаУпр			=СтрокаТВ.Всего;
			Запись.ВалютаДокумента	=Документ.Валюта;
			Запись.СуммаДокумента	=СтрокаТВ.Всего;
			
			Если Документ.Дата>='20080101' Тогда
				ЗаписьОплаты=ТДВ.Добавить();				
				ЗаполнитьЗначенияСвойств(ЗаписьОплаты,Запись);
				
				ЗаписьОплаты.ВидДвижения=ВидДвиженияОплаты;
			КонецЕсли;
		КонецЦикла;	
		//крохин начало 05.05.2011
		//крохин начало 10.04.2013
		//франчайзинг - реквизит подразделения
		//с 1 апреля 2011 г.  продажа сертификатов формирует дебиторскую задолженность перед контрагентом "оплата сертификатом"
		//Если ТекДок.Дата >= '20110401' И Документ.Подразделение.Код<>"SSP-0148" Тогда //+++Чирков 25.01.13 - по просьбе Новикова сертификаты по франчайзингу вообще не отражаем 
		//крохин начало 13.05.2013
		//косяк
		//Если ТекДок.Дата >= '20110401' И Документ.Подразделение.ВидПодразделения=Перечисления.ВидыПодразделений.Франчайзинг Тогда
		Если ТекДок.Дата >= '20110401' И Документ.Подразделение.ВидПодразделения<>Перечисления.ВидыПодразделений.Франчайзинг Тогда
			//крохин конец 13.05.2013	
			
			//крохин конец 10.04.2013	
			//продажа
			СуммаПроданныхСертификатов = 0;
			Для Каждого СтрокаТч Из Документ.Товары Цикл
				Если  СтрокаТч.Номенклатура.Родитель.ВидНоменклатуры = Перечисления.ВидыНоменклаутры.ПодарочныйСертификат	Тогда
					СуммаПроданныхСертификатов = СуммаПроданныхСертификатов + СтрокаТч.Всего;
				КонецЕсли;
			КонецЦикла;
			
			Если СуммаПроданныхСертификатов > 0 Тогда
				ТекКонтрагент = Справочники.Контрагенты.НайтиПоКоду("SMN-7258");
				Запись=ТДВ.Добавить();
				
				Запись.Период			=Документ.Дата;
				Запись.Активность		=Истина;
				
				Запись.ВидДвижения		=ВидДвиженияОплаты;
				//крохин начало 15.09.2024
				//по сертификатам код операции всегда продажа
				//Запись.КодОперации		=Документ.КодОперации;						
				Запись.КодОперации		=Перечисления.КодыОперацийОстатки.Реализация;
				//крохин конец 15.09.2024
				Запись.Контрагент		=ТекКонтрагент;
                Запись.Договор = ТекКонтрагент.ОсновнойДоговор;

				Запись.СуммаВал			=СуммаПроданныхСертификатов;
				Запись.СуммаУпр			=СуммаПроданныхСертификатов;
				Запись.ВалютаДокумента	=Документ.Валюта;
				Запись.СуммаДокумента	=СуммаПроданныхСертификатов;
				
				////+++Чирков балансировка ПС 21.01.13
				//Если Документ.Подразделение.Код="SSP-0148" Тогда
				//	ТекКонтрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-3864"); //ЧАСТНОЕ ЛИЦО Альянс групп
				//	
				//	Запись=ТДВ.Добавить();
				//	
				//	Запись.Период			=Документ.Дата;
				//	Запись.Активность		=Истина;
				//	
				//	Запись.ВидДвижения		=?(ВидДвиженияОплаты=ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
				//	Запись.КодОперации		=Документ.КодОперации;						
				//	
				//	Запись.Контрагент		=ТекКонтрагент;
				//	Запись.Договор 			=Справочники.Договоры.НайтиПоКоду("SNL-012320");
				//	
				//	Запись.СуммаВал			=СуммаПроданныхСертификатов;
				//	Запись.СуммаУпр			=СуммаПроданныхСертификатов;
				//	Запись.ВалютаДокумента	=Документ.Валюта;
				//	Запись.СуммаДокумента	=СуммаПроданныхСертификатов;											
				//КонецЕсли;				
				////---Чирков балансировка ПС
			КонецЕсли;
			
			//оплата
			СуммаОплатыСертификатами = 0;
			Для Каждого СтрокаТч Из Документ.ПодарочныеСертификаты Цикл
				Если СтрокаТЧ.ВидСертификата <>  Справочники.ВидыПодарочныхСертификатов.Содексо Тогда
					//Малахов Убрать купоны из проводок начало
					//Если НЕ СтрокаТЧ.Сертификат.Подарок Тогда
					Если НЕ СтрокаТЧ.Сертификат.Подарок и не СтрокаТЧ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.КупонНаСкидку Тогда
					//Малахов Убрать купоны из проводок конец 
						//крохин начало 30.01.2017
						//с 01.02.2017 г. разница выплачивается покупателю, если была выдана через РКО
						//СуммаОплатыСертификатами = СуммаОплатыСертификатами + СтрокаТЧ.Номинал;
							//крохин начало 15.09.2024
	//с 01.08.2024 сдача оформляется как возвратный ОКС
					//	Если СтрокаТЧ.Сдача = 0 Тогда
					    Если СтрокаТЧ.Сдача = 0 И ТекДок.Дата < '20240801' Тогда
	//крохин конец 15.09.2024
							СуммаОплатыСертификатами = СуммаОплатыСертификатами + СтрокаТЧ.Номинал;	
						Иначе
							СуммаОплатыСертификатами = СуммаОплатыСертификатами + СтрокаТЧ.СуммаОплатыСертификатами;
						КонецЕсли;
						//крохин конец 30.01.2017
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если СуммаОплатыСертификатами > 0 Тогда
				ТекКонтрагент = Справочники.Контрагенты.НайтиПоКоду("SMN-7258");
				Запись=ТДВ.Добавить();
				
				Запись.Период			=Документ.Дата;
				Запись.Активность		=Истина;
				
				Запись.ВидДвижения		=ВидДвижения;
				Запись.КодОперации		=Документ.КодОперации;						
				Запись.Контрагент		=ТекКонтрагент;
                Запись.Договор = ТекКонтрагент.ОсновнойДоговор;

				Запись.СуммаВал			=СуммаОплатыСертификатами;
				Запись.СуммаУпр			=СуммаОплатыСертификатами;
				Запись.ВалютаДокумента	=Документ.Валюта;
				Запись.СуммаДокумента	=СуммаОплатыСертификатами;
				
				////+++Чирков балансировка ПС 21.01.13
				//Если Документ.Подразделение.Код="SSP-0148" Тогда
				//	ТекКонтрагент = Справочники.Контрагенты.НайтиПоКоду("SSR-3864"); //ЧАСТНОЕ ЛИЦО Альянс групп
				//	
				//	Запись=ТДВ.Добавить();
				//	
				//	Запись.Период			=Документ.Дата;
				//	Запись.Активность		=Истина;
				//	
				//	Запись.ВидДвижения		=?(ВидДвижения=ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
				//	Запись.КодОперации		=Документ.КодОперации;						
				//	
				//	Запись.Контрагент		=ТекКонтрагент;
				//	Запись.Договор 			=Справочники.Договоры.НайтиПоКоду("SNL-012320");
				//	
				//	Запись.СуммаВал			=СуммаОплатыСертификатами;
				//	Запись.СуммаУпр			=СуммаОплатыСертификатами;
				//	Запись.ВалютаДокумента	=Документ.Валюта;
				//	Запись.СуммаДокумента	=СуммаОплатыСертификатами;											
				//КонецЕсли;				
				////---Чирков балансировка ПС
			КонецЕсли;
										//крохин начало 27.07.2021
	//сдача с сертификата, всегда наличные
            СуммаСдачиСертификаты = 0;
			Для Каждого СтрокаТч Из Документ.ПодарочныеСертификаты Цикл
			//Малахов Убрать купоны из проводок начало
				Если не СтрокаТЧ.ВидСертификата=Справочники.ВидыПодарочныхСертификатов.КупонНаСкидку Тогда
					СуммаСдачиСертификаты = СуммаСдачиСертификаты + СтрокаТЧ.Сдача;
				КонецЕсли;
			//Малахов конец
		    КонецЦикла;
		
		 //крохин начало 14.03.2024
		 //крохин начало 14.03.2024
	//сдача сертификата оформляется как возврат сертификата
	    Если Документ.Дата>='20240101' Тогда
		СуммаСдачиСертификаты = 0;
		КонецЕсли;
		 //крохин конец 14.03.2024
		
		Если СуммаСдачиСертификаты > 0 Тогда
			
			Запись=ТДВ.Добавить();
			
			Запись.Период			=Документ.Дата;
			Запись.Активность		=Истина;
			
			Запись.ВидДвижения		=ВидДвиженияНакопления.Приход;
			Запись.КодОперации		=Перечисления.КодыОперацийОстатки.ВозвратОтПокупателя;
			
			ТекКонтрагент			=СтрокаТВ.Контрагент;
			Если ТекКонтрагент<>Неопределено И НЕ ТекКонтрагент.Пустая() И НЕ ТекКонтрагент.Ведущий.Пустая() Тогда
				ТекКонтрагент		=ТекКонтрагент.Ведущий;		
			КонецЕсли;
			
			Запись.Контрагент		=ТекКонтрагент;
			Если СтрокаТВ.СДокументами Тогда
				Запись.Договор			=ТекКонтрагент.ОсновнойДоговор;			
			Иначе
				Запись.Договор			=ТекКонтрагент.ОсновнойДоговорКасса;
			КонецЕсли;
				Если Документ.Дата >= '20101001' Тогда
				Если СтрокаТВ.Контрагент<>Неопределено И Запись.Договор = Справочники.Договоры.ПустаяСсылка() Тогда
					Запись.Договор = СтрокаТВ.Контрагент.ОсновнойДоговорКасса;
					Если Запись.Договор = Справочники.Договоры.ПустаяСсылка() Тогда
						Запись.Договор = СтрокаТВ.Контрагент.ОсновнойДоговор;	
					КонецЕсли;
					Если Запись.Договор = Справочники.Договоры.ПустаяСсылка() Тогда
						Запись.Договор = СтрокаТВ.Контрагент.Ведущий.ОсновнойДоговорКасса;	
					КонецЕсли;
					Если Запись.Договор = Справочники.Договоры.ПустаяСсылка() Тогда
						Запись.Договор = СтрокаТВ.Контрагент.Ведущий.ОсновнойДоговор;	
					КонецЕсли;
				КонецЕсли;
			Конецесли;
			
			
			Запись.СуммаВал			=СуммаСдачиСертификаты;
			Запись.СуммаУпр			=СуммаСдачиСертификаты;
			Запись.ВалютаДокумента	=Документ.Валюта;
			Запись.СуммаДокумента	=СуммаСдачиСертификаты;
			

		КонецЕсли;
			
			//крохин конец 27.07.2021

		КонецЕсли;
		//крохин конец 05.05.2011
		
	КонецЕсли;
	
	//+++Чирков 30.04.2026 СФ на АВ - промежуточные договора возвратов
	Если ИспользоватьВспомогательныеДоговораПриВозвратах(ДатаДокумента) Тогда
		Если ТекВид = "РекламационнаяНакладная"
			//+++ Чирков 19.05.2026 OUT-218
			И Документ.ВидРекламации = Перечисления.ВидыРекламаций.Возврат 
			//--- Чирков 19.05.2026
			Тогда
			Если ТДВ.Количество() = 1 Тогда
				ЗаписьИсх	= ТДВ[0];
				ЗаписьНов	= ТДВ.Добавить();
				
				ЗаполнитьЗначенияСвойств(ЗаписьНов, ЗаписьИсх);
				
				ЗаписьНов.Договор = Справочники.Договоры.НайтиСоздатьДоговорВозврата(ЗаписьИсх.Договор);
				ЗаписьНов.ВидДвижения = ?(ЗаписьИсх.ВидДвижения = ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
			КонецЕсли;			
		КонецЕсли;	
	КонецЕсли;
	//---Чирков 30.04.2026 СФ на АВ - промежуточные договора возвратов
	
	Движения=Новый Структура("Взаиморасчеты",ТДВ);		
	
	Возврат Новый Структура("Результат,ТОшибок",Результат,ТОшибок);
КонецФункции           

Функция ЕстьСтрокиРекламацийвПНК(ПНК_Ссылка)            
	Запрос = Новый Запрос;
	Запрос.Текст = "    
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Рекламация
	|ИЗ
	|	Документ.ПриходнаяНакладная.Рекламации
	|ГДЕ
	|	Ссылка = &ПНК_Ссылка	
	|";
	
	Запрос.УстановитьПараметр("ПНК_Ссылка", ПНК_Ссылка);
	Выборка	= Запрос.Выполнить().Выбрать();
	
	Возврат (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Рекламация));
КонецФункции //ЕстьСтрокиРекламацийвПНК(ПНК_Ссылка)

Функция ПроведениеПоРегистрамВзаиморасчетов(ДокументСсылка,Движения) Экспорт
	РезультатПроведения	=ПровестиПоВзаиморасчетам(ДокументСсылка,Движения);	
	Возврат РезультатПроведения;		
КонецФункции

Функция ПолучитьВалютуРасчетов(Договор) Экспорт
	Если ЗначениеЗаполнено(Договор) И ТипЗнч(Договор)=Тип("СправочникСсылка.Договоры") И ЗначениеЗаполнено(Договор.ВалютаКредита) Тогда
		Возврат Договор.ВалютаКредита;
	Иначе
		Возврат ПараметрыСеанса.ВалютаНац;	
	КонецЕсли; 
КонецФункции //ПолучитьВалютуРасчетов(Договор)

// +++ 2011-11-21 сезонные бонусы
// Возвращает договор с видом "Сезонный бонус" для указанного Контрагента.
//
Функция ПолучитьДоговорСезонногоБонуса(Контрагент) Экспорт
	
	ДоговорСезонногоБонуса = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Договоры.Ссылка
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Владелец = &Контрагент
	|	И Договоры.ВидДоговора_Новый = ЗНАЧЕНИЕ(Справочник.ВидыДоговоров.СезонныйБонус)";
	Запрос.УстановитьПараметр("Контрагент", ?(Контрагент.Ведущий.Пустая(), Контрагент, Контрагент.Ведущий));
	РезультатЗапрос = Запрос.Выполнить();
	Если НЕ РезультатЗапрос.Пустой() Тогда
		Выборка = РезультатЗапрос.Выбрать();
		Выборка.Следующий();
		ДоговорСезонногоБонуса = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ДоговорСезонногоБонуса;
	
КонецФункции
// 2011-11-21 сезонные бонусы +++

// Кухарь А.Ю. 23.06.2020 начало
//
Функция ИнициализироватьТаблицуРасходов(Документ,Контрагент,Договор,ОтдельныеДоговораРасходов)
	ТЗРасходов=новый ТаблицаЗначений;
	ТЗРасходов.Колонки.Добавить("ВидРасходов");
	ТЗРасходов.Колонки.Добавить("Договор");
	
	//крохин начало 15.08.2020
	//проводки по расходам делаются только при наличии этих расходов в УПД к отчету комиссионера. Иначе делаются отдельные УСО
	//СтрТЗ=ТЗРасходов.Добавить();
	//СтрТЗ.ВидРасходов="СуммаПрочихРасходов";
	//СтрТЗ.Договор=Договор;
	//СтрТЗ=ТЗРасходов.Добавить();
	//СтрТЗ.ВидРасходов="СуммаТранспортныхРасходов";
	//СтрТЗ.Договор=Договор;
	//СтрТЗ=ТЗРасходов.Добавить();
	//СтрТЗ.ВидРасходов="СуммаКомиссионныхРасходов";
	//СтрТЗ.Договор=Договор;
	//СтрТЗ=ТЗРасходов.Добавить();
	//СтрТЗ.ВидРасходов="СуммаСкладскаяОбработка";
	//СтрТЗ.Договор=Договор;
	//СтрТЗ=ТЗРасходов.Добавить();
	//СтрТЗ.ВидРасходов="СуммаПлатноеХранение";
	//СтрТЗ.Договор=Договор;
	//СтрТЗ=ТЗРасходов.Добавить();
	//СтрТЗ.ВидРасходов="СуммаАгентскоеВознаграждение";
	//СтрТЗ.Договор=Договор;	
	
	УчитыватьКомиссионныеРасходы = Документ.УчитыватьКомиссионныеРасходы;
	
	Если УчитыватьКомиссионныеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьКомиссионныеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
	СтрТЗ=ТЗРасходов.Добавить();
	СтрТЗ.ВидРасходов="СуммаКомиссионныхРасходов";
	СтрТЗ.Договор=Договор;
	КонецЕсли;

	УчитыватьТранспортныеРасходы = Документ.УчитыватьТранспортныеРасходы;
	
	Если УчитыватьТранспортныеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьТранспортныеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
	СтрТЗ=ТЗРасходов.Добавить();
	СтрТЗ.ВидРасходов="СуммаТранспортныхРасходов";
	СтрТЗ.Договор=Договор;
	КонецЕсли;

	УчитыватьПрочиеРасходы = Документ.УчитыватьПрочиеРасходы;
	
	Если УчитыватьПрочиеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьПрочиеРасходы = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
	СтрТЗ=ТЗРасходов.Добавить();
	СтрТЗ.ВидРасходов="СуммаПрочихРасходов";
	СтрТЗ.Договор=Договор;
    КонецЕсли;
	
	УчитыватьСкладскуюОбработку = Документ.УчитыватьСкладскуюОбработку;
	
	Если УчитыватьСкладскуюОбработку = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьСкладскуюОбработку = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
	СтрТЗ=ТЗРасходов.Добавить();
	СтрТЗ.ВидРасходов="СуммаСкладскаяОбработка";
	СтрТЗ.Договор=Договор;
КонецЕсли;

УчитыватьПлатноеХранение = Документ.УчитыватьПлатноеХранение;

	Если УчитыватьПлатноеХранение = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьПлатноеХранение = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
	СтрТЗ=ТЗРасходов.Добавить();
	СтрТЗ.ВидРасходов="СуммаПлатноеХранение";
	СтрТЗ.Договор=Договор;
КонецЕсли;

УчитыватьАгентскоеВознаграждение = Документ.УчитыватьАгентскоеВознаграждение;

Если УчитыватьАгентскоеВознаграждение = Перечисления.СпособыУчетаРасходовКомиссионера.УПДкОтчетуКомиссионера ИЛИ УчитыватьАгентскоеВознаграждение = Перечисления.СпособыУчетаРасходовКомиссионера.УПДотсутствует Тогда
	СтрТЗ=ТЗРасходов.Добавить();
	СтрТЗ.ВидРасходов="СуммаАгентскоеВознаграждение";
	СтрТЗ.Договор=Договор;
	КонецЕсли;



	//крохин конец 15.08.2020
	
	если ОтдельныеДоговораРасходов тогда
		Запрос=новый запрос;
		запрос.Текст= "ВЫБРАТЬ
		|	РеквизитыСправочников.ИмяРеквизита КАК ИмяРеквизита,
		|	РеквизитыСправочников.ЗначениеРеквизита КАК ЗначениеРеквизита
		|ИЗ
		|	РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
		|ГДЕ
		|	РеквизитыСправочников.Справочник = &Справочник";
		запрос.УстановитьПараметр("Справочник",Контрагент);
		результат=запрос.Выполнить().Выгрузить();	
		Для каждого СтрТЗ из ТЗРасходов цикл
			СтрокаРезультата=ТЗРасходов.Найти(СтрЗаменить(СтрТЗ.ВидРасходов,"Сумма","Договор"),"ИмяРеквизита");
			Если СтрокаРезультата<>Неопределено тогда
				СтрТЗ.Договор=СтрокаРезультата.ЗначениеРеквизита;
			КонецЕсли;	
		КонецЦикла;		
	КонецЕсли;
	
	возврат ТЗРасходов;
	
КонецФункции
// Кухарь А.Ю. 23.06.2020 конец
